/**
 * 第15章 范型
 * @author niu
 */
package generics;
/**
15.1 与C++的比较
15.2 简单泛型
15.2.1 一个元组类库
15.2.2 一个堆栈类
15.2.3 RandomList
15.3 泛型接口
15.4 泛型方法
15.4.1 杠杆利用类型参数推断
15.4.2 可变参数与泛型方法
15.4.3 用于Generator的泛型方法
15.4.4 一个通用的Generator
15.4.5 简化元组的使用
15.4.6 一个Set实用工具
15.5 匿名内部类
15.6 构建复杂模型
15.7 搽除的神秘之处
15.7.1 C++的方式
15.7.2 迁移兼容性
15.7.3 搽除的问题
15.7.4 边界出的动作
15.8 搽除的补偿
15.8.1 创建类型实例
15.8.2 范型数组
15.9 边界
15.10 通配符
15.11 问题
15.11.1 任何基本类型都不能作为类型参数
15.11.2 实现参数化接口
15.11.3 转型和警告
15.11.4 重载
15.11.5 基类劫持了接口
15.12 自限定的类型
15.12.1 古怪的循环泛型
*/